app/controllers/drug_controller.rb

  def name
    @names = Drug.find(:all,:conditions =>["name LIKE ?","%" + params[:search_string] + "%"]).collect{|drug| drug.name}
---
SELECT * FROM `drug` WHERE (name LIKE '%%') AND (drug.retired = 0)

  def delivery
    @drugs = Drug.find(:all).map{|d|d.name}.compact.sort rescue []
---
SELECT * FROM `drug` WHERE (drug.retired = 0)

  def create_stock
    # raise params.to_yaml

    obs = params[:observations]
    delivery_date = obs[0]['value_datetime']
    expiry_date = obs[1]['value_datetime']
    drug_id = Drug.find_by_name(params[:drug_name]).id
---
SELECT * FROM `drug` WHERE (`drug`.`name` = 'INH or H (Isoniazid 100mg tablet)') AND (drug.retired = 0) LIMIT 1

  def edit_stock
    if request.method == :post
      obs = params[:observations]
      edit_reason = obs[0]['value_coded_or_text']
      encounter_datetime = obs[1]['value_datetime']
      drug_id = Drug.find_by_name(params[:drug_name]).id
---
SELECT * FROM `drug` WHERE (`drug`.`name` = 'Triomune-30') AND (drug.retired = 0) LIMIT 1

  def stock_report
    @start_date = params[:start_date].to_date
    @end_date = params[:end_date].to_date

    #TODO
    #need to redo the SQL query
    @stock = {}
    ids = Pharmacy.active.find(:all).collect{|p|p.drug_id} rescue []
---
SELECT * FROM `drug` WHERE (drug_id IN (3)) AND (drug.retired = 0)

  def print_barcode
    if request.post?
      print_and_redirect("/drug/print?drug_id=#{params[:drug_id]}&quantity=#{params[:pill_count]}", "/drug/print_barcode")
    else
      @drugs = Drug.find(:all,:conditions =>["name IS NOT NULL"])
---
SELECT * FROM `drug` WHERE (name IS NOT NULL) AND (drug.retired = 0)

  def print
    pill_count = params[:quantity]
    drug = Drug.find(params[:drug_id])
---
SELECT * FROM `drug` WHERE (`drug`.`drug_id` = 2) AND (drug.retired = 0)

  def available_name
    ids = Pharmacy.active.find(:all).collect{|p|p.drug_id} rescue []
---
SELECT * FROM `drug` WHERE (name LIKE '%%' AND drug_id IN (3,5,21,2,2)) AND (drug.retired = 0)