app/controllers/sessions_controller.rb

SELECT * FROM `location` WHERE (`location`.`location_id` = 724) AND (location.retired = 0)
---
  def update
    # First try by id, then by name
    location = Location.find(params[:location]) rescue nil